# Pandas week 4

# 13. Konversi nilai numerik ke dalam kategori pada Data Frame

In [ ]:
#import modules
import pandas as pd
import numpy as np 

#check Version
print(pd.__version__)
print(np.__version__)

In [ ]:
#Data Frame Prep
n_rows = 10
n_cols = 1
cols = ('usia',)

df = pd.DataFrame(np.random.randint(1,99, size=(n_rows, n_cols)),
                 columns=cols)

df

# Pengelompokan nilai numerik ke dalam bebearap kategori menggunakan cut()

In [15]:
df['Kelompok usia'] = pd.cut(df['usia'],
                            bins= [0,18,65,99],
                            labels=['anak', 'dewasa', 'manula'])
#anak: 0-18
#dewasa: 18-65
#manula: 65-99
df

   usia Kelompok usia
0     7          anak
1    51        dewasa
2    86        manula
3    70        manula
4    14          anak
5    62        dewasa
6    19        dewasa
7    74        manula
8    39        dewasa
9    47        dewasa

# 14. Menggabungkan (merge) dua Data Frame

In [53]:
#import modules
import pandas as pd
import numpy as np 

#check Version
print(pd.__version__)
print(np.__version__)

1.1.3
1.19.2

Data Frame Prep

In [54]:
n_rows = 5
n_cols = 5
cols = tuple('ABCDE')

kf = pd.DataFrame(np.random.randint(1,20, size=(n_rows, n_cols)),
                 columns=cols)

kf.head()

    A   B   C   D   E
0   6   9   7   6  14
1  11  17  15   8  14
2  13   2   6  18   4
3   4  17  11   8   4
4  16   2  14  14  17

In [55]:
kf1= kf.copy(deep = True)
kf1= kf1.drop([1,4])
#drop unutk membuang index yang kita mau
kf1

    A   B   C   D   E
0   6   9   7   6  14
2  13   2   6  18   4
3   4  17  11   8   4

In [56]:
kf2= kf.copy(deep = True)
kf2= kf2.drop([0,4])
df2

    A   B   C   D   E
1   3  17   8   1   1
2  17   2   7  16  15
3   9  19  18  13   8

# Menggabungkan dua Data Frame

In [57]:
kf_inner=pd.merge(kf1,kf2, how='inner')
#inner: menggabungkan dua data Frame dimana data frame yang baru akan berisi baris yang terdapat pada kedua data frame sumbernya
df_inner

    A   B   C   D   E
0  17   2   7  16  15
1   9  19  18  13   8

In [58]:
kf_outer=pd.merge(kf1,kf2, how='outer')
#outer: menggabungkan dua data Frame dimana data frame yang baru akan berisi baris yang terdapat pada semua data frame sumbernya dan menghilangkan duplikatnya (bila ada)
df_outer

    A   B   C   D   E
0  16   1  18  16  14
1  17   2   7  16  15
2   9  19  18  13   8
3   3  17   8   1   1

# 15. Memecah nilai string suatu kolom ke dalam beberapa kolom baru

In [37]:
#import modules
import pandas as pd
import numpy as np 

#check Version
print(pd.__version__)
print(np.__version__)

1.1.3
1.19.2

In [1]:
#Data Frame Prep
data = {'nama':['Ryan Reindhardt', 'Robert Allen','Joseph Lucas'],
        'tempat_kelahiran':['Surakarta, Jawa Tengah', 'Jakarta, DKI Jakarta', 'Mojoker, Jawa Timur']}

nf= pd.DataFrame(data)

nf

NameError: name 'pd' is not defined

# Memecah nama depan dan nama belakang

In [60]:
nf[['nama_depan','nama_belakang']]= df['nama'].str.split(' ',expand=True)
#nama dipecah atau displit berdasarkan spasi(paramter pertama)
#parameter tambahan (expand=True) berarti kita menginjinkan outputnya berupa kolom
nf

            nama        tempat_kelahiran nama_depan nama_belakang
0    Didi kempot  Surakarta, Jawa Tengah       Didi        kempot
1  Glenn Fredyly    Jakarta, DKI Jakarta      Glenn       Fredyly
2     Mbah Surip     Mojoker, Jawa Timur       Mbah         Surip

# Memecah nama kota dan nama propinsi

In [61]:
nf[['kota','propinsi']]= nf['tempat_kelahiran'].str.split(',',expand=True)
#tempat_kelahiran dipecah atau displit berdasarkan tanda koma(,)(paramter pertama)
df

,nama,tempat_kelahiran,nama_depan,nama_belakang,kota,propinsi
0,Didi kempot,"Surakarta, Jawa Tengah",Didi,kempot,Surakarta,Jawa Tengah
1,Glenn Fredyly,"Jakarta, DKI Jakarta",Glenn,Fredyly,Jakarta,DKI Jakarta
2,Mbah Surip,"Mojoker, Jawa Timur",Mbah,Surip,Mojoker,Jawa Timur

# 16. Menata ulang Data Frame dengan multiple indexes menggunakan unstack()

In [51]:
#import modules
import pandas as pd
import numpy as np 

#check Version
print(pd.__version__)
print(np.__version__)

1.1.3
1.19.2

In [62]:
#Data Frame Prep
uf = pd.read_csv('C:/Users/Markvinson/Visualisasi data/Pandas/datasets/titanicfull.csv')
uf.head()

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.00,0,0,24160,211.3375,B5,S
1,1,1,"Allison, Master. Hudson Trevor",male,0.92,1,2,113781,151.5500,C22 C26,S
2,1,0,"Allison, Miss. Helen Loraine",female,2.00,1,2,113781,151.5500,C22 C26,S
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.00,1,2,113781,151.5500,C22 C26,S
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.00,1,2,113781,151.5500,C22 C26,S

# Data Frame dengan multiple indexes dari hasil groupping

In [65]:
uf.groupby(['sex', 'pclass'])['survived'].mean().to_frame()

               survived
sex    pclass
female 1       0.965278
       2       0.886792
       3       0.490741
male   1       0.340782
       2       0.146199
       3       0.152130

# Menata ulang Data Frame dengan multiple indexes

In [67]:
uf.groupby(['sex', 'pclass'])['survived'].mean().unstack()

pclass         1         2         3
sex
female  0.965278  0.886792  0.490741
male    0.340782  0.146199  0.152130

source: https://www.youtube.com/playlist?list=PL2O3HdJI4voGdD_9xhVCTBoDTDNHpajm5